//package bytedance
//
//182. 查找重复的电子邮箱
//79.6%
//简单
//17. 电话号码的字母组合
//55.8%
//中等
//169. 多数元素
//65.6%
//简单
//181. 超过经理收入的员工
//70.2%
//简单
//1051. 高度检查器
//74.5%
//简单
//6. Z 字形变换
//49.4%
//中等
//67. 二进制求和
//54.4%
//简单
//922. 按奇偶排序数组 II
//71.5%
//简单
//100. 相同的树
//60.2%
//简单
//876. 链表的中间结点
//69.9%
//简单
//454. 四数相加 II
//58.4%
//中等
//214. 最短回文串
//36.7%
//困难
//89. 格雷编码
//69.7%
//中等
//222. 完全二叉树的节点个数
//76.8%
//中等
//455. 分发饼干
//57.7%
//简单
//119. 杨辉三角 II
//62.7%
//简单
//136. 只出现一次的数字
//70.8%
//简单
//118. 杨辉三角
//69.8%
//简单
//349. 两个数组的交集
//73.5%
//简单
//240. 搜索二维矩阵 II